package chapter06.problem;

/**
 * 問題6-2
 * 0~9の2乗のグラフを書くプログラムを作成せよ。
 * つまり以下のようなグラフである。
 * 0:
 * 1:*
 * 2:****
 * 3:*********
 * 4:************
 * 5:*************************
 * 6:************************************
 * 7:*************************************************
 * 8:****************************************************************
 * 9:*********************************************************************************
 *
 * @author shunji.yamaguchi
 *
 */
public class Problem6_2 {
    public static void main(String[] arg) {
        for (int i = 0; i < 10; i++) {
            System.out.print(i + ":");
            for (int k = 0; k < i * i; k++) {
                System.out.print("*");
            }
            System.out.println();
        }
    }
}
